Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FV16KM204.h
extern volatile CCP3CON2LBITS CCP3CON2Lbits __attribute__((__sfr__));

#define CCP3CON2H CCP3CON2H
extern volatile unsigned int  CCP3CON2H __attribute__((__sfr__));
__extension__ typedef struct tagCCP3CON2HBITS {
  union {
    struct {
      unsigned ICS:3;
      unsigned AUXOUT:2;
      unsigned :1;
      unsigned ICGSM:2;
      unsigned OCAEN:1;
      unsigned OCBEN:1;
      unsigned OCCEN:1;
      unsigned OCDEN:1;
      unsigned OCEEN:1;
      unsigned OCFEN:1;
      unsigned :1;
      unsigned OENSYNC:1;
    };
    struct {
      unsigned ICS0:1;
      unsigned ICS1:1;
      unsigned ICS2:1;
      unsigned AUXOUT0:1;
      unsigned AUXOUT1:1;
      unsigned :1;
      unsigned ICGSM0:1;
      unsigned ICGSM1:1;
    };
    struct {
      unsigned ICSEL:3;
    };
    struct {
      unsigned ICSEL0:1;
      unsigned ICSEL1:1;
      unsigned ICSEL2:1;
    };
  };
} CCP3CON2HBITS;
extern volatile CCP3CON2HBITS CCP3CON2Hbits __attribute__((__sfr__));

#define CCP3CON3L CCP3CON3L
extern volatile unsigned int  CCP3CON3L __attribute__((__sfr__));
__extension__ typedef struct tagCCP3CON3LBITS {
  union {
    struct {
      unsigned DT:6;
    };
    struct {
      unsigned DT0:1;
      unsigned DT1:1;
      unsigned DT2:1;
      unsigned DT3:1;
      unsigned DT4:1;
      unsigned DT5:1;
    };
  };
} CCP3CON3LBITS;
extern volatile CCP3CON3LBITS CCP3CON3Lbits __attribute__((__sfr__));

#define CCP3CON3H CCP3CON3H
extern volatile unsigned int  CCP3CON3H __attribute__((__sfr__));
__extension__ typedef struct tagCCP3CON3HBITS {
  union {
    struct {
      unsigned PSSBDF:2;
      unsigned PSSACE:2;
      unsigned POLBDF:1;
      unsigned POLACE:1;
      unsigned :2;
      unsigned OUTM:3;
      unsigned :1;
      unsigned OSCNT:3;
      unsigned OETRIG:1;
    };
    struct {
      unsigned PSSBDF0:1;
      unsigned PSSBDF1:1;
      unsigned PSSACE0:1;
      unsigned PSSACE1:1;
      unsigned :4;
      unsigned OUTM0:1;
      unsigned OUTM1:1;
      unsigned OUTM2:1;
      unsigned :1;
      unsigned OSCNT0:1;
      unsigned OSCNT1:1;
      unsigned OSCNT2:1;
    };
  };
} CCP3CON3HBITS;
extern volatile CCP3CON3HBITS CCP3CON3Hbits __attribute__((__sfr__));

#define CCP3STAT CCP3STAT
extern volatile unsigned int  CCP3STAT __attribute__((__sfr__));
__extension__ typedef struct tagCCP3STATBITS {
  union {
    struct {
      unsigned ICBNE:1;
      unsigned ICOV:1;
      unsigned ICDIS:1;
      unsigned SCEVT:1;
      unsigned ASEVT:1;
      unsigned TRCLR:1;
      unsigned TRSET:1;
      unsigned CCPTRIG:1;
      unsigned :2;
      unsigned ICGARM:1;
    };
    struct {
      unsigned :7;
      unsigned TRIG:1;
    };
  };
} CCP3STATBITS;
extern volatile CCP3STATBITS CCP3STATbits __attribute__((__sfr__));

#define CCP3STATL CCP3STATL
extern volatile unsigned int  CCP3STATL __attribute__((__sfr__));
__extension__ typedef struct tagCCP3STATLBITS {
  union {
    struct {
      unsigned ICBNE:1;
      unsigned ICOV:1;
      unsigned ICDIS:1;
      unsigned SCEVT:1;
      unsigned ASEVT:1;
      unsigned TRCLR:1;
      unsigned TRSET:1;
      unsigned CCPTRIG:1;
      unsigned :2;
      unsigned ICGARM:1;
    };
    struct {
      unsigned :7;
      unsigned TRIG:1;
    };
  };
} CCP3STATLBITS;
extern volatile CCP3STATLBITS CCP3STATLbits __attribute__((__sfr__));

#define CCP3TMRL CCP3TMRL
extern volatile unsigned int  CCP3TMRL __attribute__((__sfr__));
#define CCP3TMRH CCP3TMRH
extern volatile unsigned int  CCP3TMRH __attribute__((__sfr__));
#define CCP3PRL CCP3PRL
extern volatile unsigned int  CCP3PRL __attribute__((__sfr__));
#define CCP3PRH CCP3PRH
extern volatile unsigned int  CCP3PRH __attribute__((__sfr__));
#define CCP3RA CCP3RA
extern volatile unsigned int  CCP3RA __attribute__((__sfr__));
#define CCP3RAL CCP3RAL
extern volatile unsigned int  CCP3RAL __attribute__((__sfr__));
#define CCP3RB CCP3RB
extern volatile unsigned int  CCP3RB __attribute__((__sfr__));
#define CCP3RBL CCP3RBL
extern volatile unsigned int  CCP3RBL __attribute__((__sfr__));
#define CCP3BUFL CCP3BUFL
extern volatile unsigned int  CCP3BUFL __attribute__((__sfr__));
#define CCP3BUFH CCP3BUFH
extern volatile unsigned int  CCP3BUFH __attribute__((__sfr__));
#define CCP4CON1L CCP4CON1L
extern volatile unsigned int  CCP4CON1L __attribute__((__sfr__));
__extension__ typedef struct tagCCP4CON1LBITS {
  union {
    struct {
      unsigned MOD:4;
      unsigned CCSEL:1;
      unsigned T32:1;
      unsigned TMRPS:2;
      unsigned CLKSEL:3;
      unsigned TMRSYNC:1;
      unsigned CCPSLP:1;
      unsigned CCPSIDL:1;
      unsigned :1;
      unsigned CCPON:1;
    };
    struct {
      unsigned MOD0:1;
      unsigned MOD1:1;
      unsigned MOD2:1;
      unsigned MOD3:1;
      unsigned :1;
      unsigned TMR32:1;
      unsigned TMRPS0:1;
      unsigned TMRPS1:1;
      unsigned CLKSEL0:1;
      unsigned CLKSEL1:1;
      unsigned CLKSEL2:1;
    };
    struct {
      unsigned CCPMOD:4;
    };
    struct {
      unsigned CCPMOD0:1;
      unsigned CCPMOD1:1;
      unsigned CCPMOD2:1;
      unsigned CCPMOD3:1;
    };
  };
} CCP4CON1LBITS;
extern volatile CCP4CON1LBITS CCP4CON1Lbits __attribute__((__sfr__));

#define CCP4CON1H CCP4CON1H
extern volatile unsigned int  CCP4CON1H __attribute__((__sfr__));
__extension__ typedef struct tagCCP4CON1HBITS {
  union {
    struct {
      unsigned SYNC:5;
      unsigned ALTSYNC:1;
      unsigned ONESHOT:1;
      unsigned TRIGEN:1;
      unsigned OPS:4;
      unsigned :2;
      unsigned RTRGEN:1;
      unsigned OPSSRC:1;
    };
    struct {
      unsigned SYNC0:1;
      unsigned SYNC1:1;
      unsigned SYNC2:1;
      unsigned SYNC3:1;
      unsigned SYNC4:1;
      unsigned :3;
      unsigned OPS0:1;
      unsigned OPS1:1;
      unsigned OPS2:1;
      unsigned OPS3:1;
      unsigned :3;
      unsigned OPSRC:1;
    };
    struct {
      unsigned :8;
      unsigned IOPS:4;
    };
    struct {
      unsigned :8;
      unsigned IOPS0:1;
      unsigned IOPS1:1;
      unsigned IOPS2:1;
      unsigned IOPS3:1;
    };
  };
} CCP4CON1HBITS;
extern volatile CCP4CON1HBITS CCP4CON1Hbits __attribute__((__sfr__));

#define CCP4CON2L CCP4CON2L
extern volatile unsigned int  CCP4CON2L __attribute__((__sfr__));
__extension__ typedef struct tagCCP4CON2LBITS {
  union {
    struct {
      unsigned ASDG:8;
      unsigned :4;
      unsigned SSDG:1;
      unsigned :1;
      unsigned ASDGM:1;
      unsigned PWMRSEN:1;
    };
    struct {
      unsigned ASDG0:1;
      unsigned ASDG1:1;
      unsigned ASDG2:1;
      unsigned ASDG3:1;
      unsigned ASDG4:1;
      unsigned ASDG5:1;
      unsigned ASDG6:1;
      unsigned ASDG7:1;
    };
  };
} CCP4CON2LBITS;
