Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FV16KM204.h
/* IFS0 */
#define _INT0IF IFS0bits.INT0IF
#define _CCP1IF IFS0bits.CCP1IF
#define _CCP2IF IFS0bits.CCP2IF
#define _T1IF IFS0bits.T1IF
#define _CCP3IF IFS0bits.CCP3IF
#define _CCP4IF IFS0bits.CCP4IF
#define _CCT1IF IFS0bits.CCT1IF
#define _CCT2IF IFS0bits.CCT2IF
#define _U1RXIF IFS0bits.U1RXIF
#define _U1TXIF IFS0bits.U1TXIF
#define _AD1IF IFS0bits.AD1IF
#define _NVMIF IFS0bits.NVMIF

/* IFS1 */
#define _SSP1IF IFS1bits.SSP1IF
#define _BCL1IF IFS1bits.BCL1IF
#define _CMIF IFS1bits.CMIF
#define _CNIF IFS1bits.CNIF
#define _INT1IF IFS1bits.INT1IF
#define _CCP5IF IFS1bits.CCP5IF
#define _CCT3IF IFS1bits.CCT3IF
#define _CCT4IF IFS1bits.CCT4IF
#define _INT2IF IFS1bits.INT2IF
#define _U2RXIF IFS1bits.U2RXIF
#define _U2TXIF IFS1bits.U2TXIF

/* IFS2 */
#define _CCT5IF IFS2bits.CCT5IF

/* IFS3 */
#define _SSP2IF IFS3bits.SSP2IF
#define _BCL2IF IFS3bits.BCL2IF
#define _RTCIF IFS3bits.RTCIF

/* IFS4 */
#define _U1ERIF IFS4bits.U1ERIF
#define _U2ERIF IFS4bits.U2ERIF
#define _HLVDIF IFS4bits.HLVDIF
#define _CTMUIF IFS4bits.CTMUIF
#define _DAC1IF IFS4bits.DAC1IF
#define _DAC2IF IFS4bits.DAC2IF

/* IFS5 */
#define _ULPWUIF IFS5bits.ULPWUIF

/* IFS6 */
#define _CLC1IF IFS6bits.CLC1IF
#define _CLC2IF IFS6bits.CLC2IF

/* IEC0 */
#define _INT0IE IEC0bits.INT0IE
#define _CCP1IE IEC0bits.CCP1IE
#define _CCP2IE IEC0bits.CCP2IE
#define _T1IE IEC0bits.T1IE
#define _CCP3IE IEC0bits.CCP3IE
#define _CCP4IE IEC0bits.CCP4IE
#define _CCT1IE IEC0bits.CCT1IE
#define _CCT2IE IEC0bits.CCT2IE
#define _U1RXIE IEC0bits.U1RXIE
#define _U1TXIE IEC0bits.U1TXIE
#define _AD1IE IEC0bits.AD1IE
#define _NVMIE IEC0bits.NVMIE

/* IEC1 */
#define _SSP1IE IEC1bits.SSP1IE
#define _BCL1IE IEC1bits.BCL1IE
#define _CMIE IEC1bits.CMIE
#define _CNIE IEC1bits.CNIE
#define _INT1IE IEC1bits.INT1IE
#define _CCP5IE IEC1bits.CCP5IE
#define _CCT3IE IEC1bits.CCT3IE
#define _CCT4IE IEC1bits.CCT4IE
#define _INT2IE IEC1bits.INT2IE
#define _U2RXIE IEC1bits.U2RXIE
#define _U2TXIE IEC1bits.U2TXIE

/* IEC2 */
#define _CCT5IE IEC2bits.CCT5IE

/* IEC3 */
#define _SSP2IE IEC3bits.SSP2IE
#define _BCL2IE IEC3bits.BCL2IE
#define _RTCIE IEC3bits.RTCIE

/* IEC4 */
#define _U1ERIE IEC4bits.U1ERIE
#define _U2ERIE IEC4bits.U2ERIE
#define _HLVDIE IEC4bits.HLVDIE
#define _CTMUIE IEC4bits.CTMUIE
#define _DAC1IE IEC4bits.DAC1IE
#define _DAC2IE IEC4bits.DAC2IE

/* IEC5 */
#define _ULPWUIE IEC5bits.ULPWUIE

/* IEC6 */
#define _CLC1IE IEC6bits.CLC1IE
#define _CLC2IE IEC6bits.CLC2IE

/* IPC0 */
#define _INT0IP IPC0bits.INT0IP
#define _CCP1IP IPC0bits.CCP1IP
#define _CCP2IP IPC0bits.CCP2IP
#define _T1IP IPC0bits.T1IP
#define _INT0IP0 IPC0bits.INT0IP0
#define _INT0IP1 IPC0bits.INT0IP1
#define _INT0IP2 IPC0bits.INT0IP2
#define _CC1IP0 IPC0bits.CC1IP0
#define _CC1IP1 IPC0bits.CC1IP1
#define _CC1IP2 IPC0bits.CC1IP2
#define _CC2IP0 IPC0bits.CC2IP0
#define _CC2IP1 IPC0bits.CC2IP1
#define _CC2IP2 IPC0bits.CC2IP2
#define _T1IP0 IPC0bits.T1IP0
#define _T1IP1 IPC0bits.T1IP1
#define _T1IP2 IPC0bits.T1IP2

/* IPC1 */
#define _CCP3IP IPC1bits.CCP3IP
#define _CCP4IP IPC1bits.CCP4IP
#define _CCT1IP IPC1bits.CCT1IP
#define _CC3IP0 IPC1bits.CC3IP0
#define _CC3IP1 IPC1bits.CC3IP1
#define _CC3IP2 IPC1bits.CC3IP2
#define _CC4IP0 IPC1bits.CC4IP0
#define _CC4IP1 IPC1bits.CC4IP1
#define _CC4IP2 IPC1bits.CC4IP2
#define _CCT1IP0 IPC1bits.CCT1IP0
#define _CCT1IP1 IPC1bits.CCT1IP1
#define _CCT1IP2 IPC1bits.CCT1IP2

/* IPC2 */
#define _CCT2IP IPC2bits.CCT2IP
#define _U1RXIP IPC2bits.U1RXIP
#define _CCT2IP0 IPC2bits.CCT2IP0
#define _CCT2IP1 IPC2bits.CCT2IP1
#define _CCT2IP2 IPC2bits.CCT2IP2
#define _U1RXIP0 IPC2bits.U1RXIP0
#define _U1RXIP1 IPC2bits.U1RXIP1
#define _U1RXIP2 IPC2bits.U1RXIP2

/* IPC3 */
#define _U1TXIP IPC3bits.U1TXIP
#define _AD1IP IPC3bits.AD1IP
#define _NVMIP IPC3bits.NVMIP
#define _U1TXIP0 IPC3bits.U1TXIP0
#define _U1TXIP1 IPC3bits.U1TXIP1
#define _U1TXIP2 IPC3bits.U1TXIP2
#define _AD1IP0 IPC3bits.AD1IP0
#define _AD1IP1 IPC3bits.AD1IP1
#define _AD1IP2 IPC3bits.AD1IP2
#define _NVMIP0 IPC3bits.NVMIP0
#define _NVMIP1 IPC3bits.NVMIP1
#define _NVMIP2 IPC3bits.NVMIP2

/* IPC4 */
#define _SSP1IP IPC4bits.SSP1IP
#define _BCL1IP IPC4bits.BCL1IP
#define _CMIP IPC4bits.CMIP
#define _CNIP IPC4bits.CNIP
#define _SSP1IP0 IPC4bits.SSP1IP0
#define _SSP1IP1 IPC4bits.SSP1IP1
#define _SSP1IP2 IPC4bits.SSP1IP2
#define _BCL1IP0 IPC4bits.BCL1IP0
#define _BCL1IP1 IPC4bits.BCL1IP1
#define _BCL1IP2 IPC4bits.BCL1IP2
#define _CMIP0 IPC4bits.CMIP0
#define _CMIP1 IPC4bits.CMIP1
#define _CMIP2 IPC4bits.CMIP2
#define _CNIP0 IPC4bits.CNIP0
#define _CNIP1 IPC4bits.CNIP1
#define _CNIP2 IPC4bits.CNIP2

/* IPC5 */
#define _INT1IP IPC5bits.INT1IP
#define _CCP5IP IPC5bits.CCP5IP
#define _INT1IP0 IPC5bits.INT1IP0
#define _INT1IP1 IPC5bits.INT1IP1
#define _INT1IP2 IPC5bits.INT1IP2
#define _CCP5IP0 IPC5bits.CCP5IP0
#define _CCP5IP1 IPC5bits.CCP5IP1
#define _CCP5IP2 IPC5bits.CCP5IP2

/* IPC6 */
#define _CCT3IP IPC6bits.CCT3IP
#define _CCT3IP0 IPC6bits.CCT3IP0
#define _CCT3IP1 IPC6bits.CCT3IP1
#define _CCT3IP2 IPC6bits.CCT3IP2

/* IPC7 */
#define _CCT4IP IPC7bits.CCT4IP
#define _INT2IP IPC7bits.INT2IP
#define _U2RXIP IPC7bits.U2RXIP
#define _U2TXIP IPC7bits.U2TXIP
#define _CCT4IP0 IPC7bits.CCT4IP0
#define _CCT4IP1 IPC7bits.CCT4IP1
#define _CCT4IP2 IPC7bits.CCT4IP2
#define _INT2IP0 IPC7bits.INT2IP0
#define _INT2IP1 IPC7bits.INT2IP1
#define _INT2IP2 IPC7bits.INT2IP2
#define _U2RXIP0 IPC7bits.U2RXIP0
#define _U2RXIP1 IPC7bits.U2RXIP1
#define _U2RXIP2 IPC7bits.U2RXIP2
#define _U2TXIP0 IPC7bits.U2TXIP0
#define _U2TXIP1 IPC7bits.U2TXIP1
#define _U2TXIP2 IPC7bits.U2TXIP2

/* IPC10 */
#define _CCT5IP IPC10bits.CCT5IP
#define _CCT5IP0 IPC10bits.CCT5IP0
#define _CCT5IP1 IPC10bits.CCT5IP1
#define _CCT5IP2 IPC10bits.CCT5IP2

/* IPC12 */
#define _SSP2IP IPC12bits.SSP2IP
#define _BCL2IP IPC12bits.BCL2IP
#define _SSP2IP0 IPC12bits.SSP2IP0
#define _SSP2IP1 IPC12bits.SSP2IP1
#define _SSP2IP2 IPC12bits.SSP2IP2
#define _BCL2IP0 IPC12bits.BCL2IP0
#define _BCL2IP1 IPC12bits.BCL2IP1
#define _BCL2IP2 IPC12bits.BCL2IP2
#define _SI2C2P0 IPC12bits.SI2C2P0
#define _SI2C2P1 IPC12bits.SI2C2P1
#define _SI2C2P2 IPC12bits.SI2C2P2
#define _MI2C2P0 IPC12bits.MI2C2P0
#define _MI2C2P1 IPC12bits.MI2C2P1
#define _MI2C2P2 IPC12bits.MI2C2P2
#define _SI2C2P IPC12bits.SI2C2P
#define _MI2C2P IPC12bits.MI2C2P

